snlkuharlocal/src/DataProcessors/ВыгрузкаЗОГ/ВыгрузкаЗОГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаЗОГ</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Календарь/Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календарь</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дни</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныйДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаВВыходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ВыгрузкаЗОГ/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	    Если ТаблицаПараметров <> Неопределено Тогда
			Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
				Если СтрокаТП.Имя = "ДатаОтгрузки" Тогда
					ДатаОтгрузки = СтрокаТП.Значение;
					Прервать;
					КонецЕсли;
			КонецЦикла;
	Иначе
		ДатаОтгрузки=Неопределено;
		КонецЕсли;
		Если ДатаОтгрузки=Неопределено Тогда
			ДатаОтгрузки=ПолучитьСледующуюДатуОтгрузкиОбработка();		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаОтгрузку.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку
		               |ГДЕ
		               |	ЗаявкаНаОтгрузку.Проведен
		               |	И ЗаявкаНаОтгрузку.ДатаОтгрузки = &ДатаОтгрузки";
		Запрос.УстановитьПараметр("ДатаОтгрузки",ДатаОтгрузки);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.ссылка.ПолучитьОбъект();
		ЗаписатьВЛог("Регистрация ЗОГ для выгрузки",Выборка.ссылка,"Информация");
		СписокПолучателей=ПолучитьСписокПолучателейИзмененийОбъектаОбработка(ДокОбъект);
		Для Каждого Узел Из СписокПолучателей Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел.Значение,ДокОбъект.Ссылка);
		КонецЦикла;

		КонецЦикла;
	КонецПроцедуры
	
	
	Функция ПолучитьСледующуюДатуОтгрузкиОбработка()  

	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Дата	
	|ИЗ
	|	Справочник.Календарь.Дни КАК КалендарьДни
	|ГДЕ
	//крохин начало 24.04.2018
	//отгрузка в выходные
	//|	КалендарьДни.Часы <> 0
	//крохин начало 01.11.2018
	//не надо
	//|	(КалендарьДни.Часы <> 0 ИЛИ КалендарьДни.ОтгрузкаВВыходной)
	|	КалендарьДни.Часы <> 0
	//крохин конец 01.11.2018
	//крохин конец 24.04.2018
	|	И КалендарьДни.Дата > &Дата0
	|	И НЕ Ссылка.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО Дата";
	
	Запрос.УстановитьПараметр("Дата0",КонецДня(ТекущаяДата()));
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дата;
	Иначе	
		ЗаписатьВЛог("Регламент","Не заполнен календарь на !","Ошибка");
		
		Возврат КонецДня(ТекущаяДата())+1;		 		
	КонецЕсли; 
КонецФункции 


Функция ПолучитьСписокПолучателейИзмененийОбъектаОбработка(Объект,ДопИнфо = Неопределено)
		ЭтотУзел			=ПланыОбмена.Основной.ЭтотУзел();		
	УправляющийУзел		=ЭтотУзел.УправляющийУзел;
	ТипУзла				=ПараметрыСеанса.ТипУзла;
	
	ОбменДанными		=Объект.ОбменДанными;
	Отправитель			=ОбменДанными.Отправитель;
	Загрузка			=ОбменДанными.Загрузка;
	
	СписокПолучателей	=Новый СписокЗначений;
	ТипОбъекта			=ТипОбъекта(Объект);
	ВидОбъекта			=Объект.Метаданные().Имя;

	//Из Волгограда ничего не грузим
			Если ПараметрыСеанса.ЭтотУзел.Подразделение.ЕстьВыделенныйСклад Тогда
				Возврат СписокПолучателей;	
			Конецесли;
			//крохин конец
			Склад		=Объект.Склад;			
			УзелСклада	=ПланыОбмена.Основной.НайтиПоКоду(Склад.КодФизическогоУзла);
			
			Если Объект.СостояниеНакладной=Перечисления.СостоянияНакладной.ВРаботе Тогда
			Иначе
				Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,Константы.УзелТранспортногоОтдела.Получить(),Отправитель,Загрузка);
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УзелСклада,Отправитель,Загрузка);
				ИначеЕсли ТипУзла=Перечисления.ТипУзлаИБ.Склад ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
					ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УправляющийУзел,Отправитель,Загрузка);
				КонецЕсли;			
			КонецЕсли;
Возврат СписокПолучателей;	
	КонецФункции

	Функция ДобавитьУзелВПолучателейОбработка(СписокПолучателей,УзелПолучатель,УзелОтправитель,Загрузка)
	Если Загрузка И УзелПолучатель=УзелОтправитель Тогда //туда-сюда гонять не будем		
	ИначеЕсли НЕ УзелПолучатель.Пустая() Тогда
		СписокПолучателей.Добавить(УзелПолучатель);
	КонецЕсли;
КонецФункции
